IDEA StatiCa Open Model
OpenModel.PointLoadsOnLine Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 List of point load impulses in this load case
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public List<PointLoadOnLine> PointLoadsOnLine { get; set; }
Public Property PointLoadsOnLine As List(Of PointLoadOnLine)
	Get
	Set
public:
property List<PointLoadOnLine^>^ PointLoadsOnLine {
	List<PointLoadOnLine^>^ get ();
	void set (List<PointLoadOnLine^>^ value);
}
Property Value
Type: List<PointLoadOnLine>
See Also
Reference
OpenModel Class
IdeaRS.OpenModel Namespace